In [42]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import json
import urllib
import requests

In [43]:
columns_name=['user_id','movie_id','rating','timestamp']
main_data_df=pd.read_csv("/Users/chipampe/Desktop/ETL_Project/Data user details/users data/ml-100k/u.data", sep="\t",names=columns_name)        

main_data_df.head()

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742
2       22       377       1  878887116
3      244        51       2  880606923
4      166       346       1  886397596

In [44]:
ts = main_data_df['timestamp'] = pd.to_datetime(main_data_df['timestamp'], unit='s')
ts_df = pd.DataFrame(ts)
ts_df

                timestamp
0     1997-12-04 15:55:49
1     1998-04-04 19:22:22
2     1997-11-07 07:18:36
3     1997-11-27 05:02:03
4     1998-02-02 05:33:16
...                   ...
99995 1997-11-22 05:10:44
99996 1997-11-17 19:39:03
99997 1997-09-20 22:49:55
99998 1997-12-17 22:52:36
99999 1997-11-19 17:13:03

[100000 rows x 1 columns]

In [45]:
data_2 = main_data_df
#data_3 = data_2.set_index('movie_id')
data_2

       user_id  movie_id  rating           timestamp
0          196       242       3 1997-12-04 15:55:49
1          186       302       3 1998-04-04 19:22:22
2           22       377       1 1997-11-07 07:18:36
3          244        51       2 1997-11-27 05:02:03
4          166       346       1 1998-02-02 05:33:16
...        ...       ...     ...                 ...
99995      880       476       3 1997-11-22 05:10:44
99996      716       204       5 1997-11-17 19:39:03
99997      276      1090       1 1997-09-20 22:49:55
99998       13       225       2 1997-12-17 22:52:36
99999       12       203       3 1997-11-19 17:13:03

[100000 rows x 4 columns]

In [46]:
movie_csv = pd.read_csv('/Users/chipampe/Desktop/ETL_Project/User_cleaned_data/movies.csv')
movie_csv

      movie_id                         movie_name
0            1                         Toy Story
1            2                         GoldenEye
2            3                        Four Rooms
3            4                        Get Shorty
4            5                           Copycat
...        ...                                ...
1677      1678                        Mat' i syn
1678      1679                         B. Monkey
1679      1680                     Sliding Doors
1680      1681                      You So Crazy
1681      1682  Scream of Stone Schrei aus Stein

[1682 rows x 2 columns]

In [47]:
new_data = pd.merge(data_2, movie_csv, on='movie_id')
new_data

,user_id,movie_id,rating,timestamp,movie_name
0,196,242,3,1997-12-04 15:55:49,Kolya
1,63,242,3,1997-10-01 23:06:30,Kolya
2,226,242,5,1998-01-04 04:37:51,Kolya
3,154,242,3,1997-11-10 05:03:55,Kolya
4,306,242,5,1997-10-10 17:16:33,Kolya
...,...,...,...,...,...
99995,840,1674,4,1998-03-29 22:48:02,Mamma Roma
99996,655,1640,3,1998-02-26 06:30:46,"Eighth Day, The"
99997,655,1637,3,1998-03-04 04:04:15,Girls Town
99998,655,1630,3,1998-02-14 03:58:55,"Silence of the Palace, The Saimt el Qusur"
99999,655,1641,3,1998-02-14 03:43:30,Dadetown

In [48]:
user_rated_movies = new_data.to_csv('User_rated_movies.csv')